package ru.progwards.java2.lessons.generics;

public class DynamicArray<T>
{
//  3.1 в классе разместить private переменную - массив обобщающего типа.
private T[] arr;

//3.2 конструктор - по умолчанию.
//DynamicArray(){arr=<T>new T[2];}
//  3.2 метод add - добавляет элемент в конец массива.
//
//3.3 метод с именем insert - добавляет элемент в заданную позицию позицию массива. Параметр int pos - первый, параметр с элементом массива - второй.
//
//3.4 метод remove(int pos) - удаляет элемент в позиции pos массива.
//
//  3.5 метод с get(int pos) - возвращает элемент по индексу pos.
//
//3.6 метод с size() - возвращает текущий реальный объем массива.



}
